
const arr = [1, 5, 4, 10, 0, 3]; 

for (let i = 0; i < numbs.length; i++) {

  if ( numbs[i] == 10) break;
  console.log(arr[i]); //Задание 1 Необходимо создать цикл, который будет выводить элементы массива до тех пор, пока не встретит значение 10.После вывода значения 10 в консоль цикл должен прекратить свою работу.


}

console.log (arr.indexOf (4));



//Задание 2 Дан массив:  Найдите позицию числа 4 в этом массиве.
 
 
const arr2= [1, 3, 5, 10, 20];

console.log (arr2.join ('-'));

//Задание 3 Дан массив чисел. С помощью метода join выведите элементы массива через пробел (пустую строку ' ').
const numbers4=[];





